// Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

// let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
// if(friends.length>=3){
//     console.log('Масив завеликий')
// } else {
//     console.log('Масив замаленкий')
// }

// Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

// let a = 10;
// let b = 15;
// let c = 5;
// if ((b > a && b < c) || (b > c && b < a)) {
//     console.log(b)
// } else if ((c > a && c < b) || (c > b && c < a)){
//     console.log(c)
// } else if ((a > b && a < c) || (a > c && a < b)) {
//     console.log(a)
// }

// Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let result;
// if (a + b < 4){
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

// let a=1
// let b=2
// result=(a + b < 4) ? 'Мало' : 'Багато'
// console.log(result)

// Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
// let test = +prompt('Введіть число');
//     test === 0 ? console.log('Це нуль') :
//     test >= 100 ? console.log('Число позитивне') : console.log('Число негативне')
