// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
// let time=+prompt("Введіть число від 0 до 59");
// if (time>=0 && time<=14){
//     console.log("Перша частина години");
// } else if (time>=15 && time<=29){
//     conlose.log('Друга частина години');
// } else if (time>=30 && time<=44){
//     console.log('Треття частина години');
// } else if (time>=45 && time<=59){
//     console.log('Четверта частина години')
// } else {
//     console.log("Неправильні дані")
// }

// У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day=+prompt("Введіть число місяця");
// if(day>=1 && day<=10){
//     console.log('Перша декада')
// }
// else if(day>=11 && day<=20){
//     console.log('Друга декада')
// } else if (day>=21 && day<31){
//     console.log('Третя декада')
// } else{
//     console.log('Неправильне число місяця')
// }
// У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test=1===1
// if( test===true){
//     console.log("Вірно")
// } else {
//     console.log('Неправильно')
// }

// let test= confirm("True or False") ? 'Вірно' : 'Неправильно';
// console.log(test);

// Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a=+prompt('Введіть число 1,0,-3');
// // if(a!==0){
// //     console.log('Вірно')
// // }else {
// //     console.log("Невірно")
// // }

// Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

// let day=+prompt('Ведіть день тижня')
// switch (day){
//     case 1 :
//         console.log("Піти в зал,кинути курити,сісти на дієту");
//         break;
//     case 2 :
//         console.log("Зробити домашнє завдання,піти на практику");
//         break;
//     case 3 :
//         console.log("Виспатись,замовити продукти");
//         break;
//     case 4 :
//         console.log("Піти на футбол,піти на практику");
//         break;
//     case 5 :
//         console.log("Піти на пари,зузтрітися з друзями");
//         break;
//     case 6 :
//         console.log("Побрибирати в кввартирі,зробити їжу на тиждень");
//         break;
//     case 7 :
//         console.log("Виспатись,піти в центр міста");
//         break;
//     default:
//         console.log("Неправильний день тижня")
// }
// Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//  let year= +prompt('Введіть кількість днів у році')
// if(year %4 ===0){
//     console.log('Рік Високосний')
// } else

// Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let JSname=prompt('Яка «офіційна» назва JavaScript?')
if (JSname==='ECMAScript'){
    console.log('Правильно!')
} else {
    console.log('Не знаєте? ECMAScript!')
}